{
  "name": "Giovanni Trovato",
  "title": "iOS Developer",
  "location": "Wonfurt, Bavaria, Germany",
  "email": "trovato.giovanni@gmail.com",
  "phone": "+39 329 8484 046",
  "portfolio": "https://sites.google.com/view/giovanni-trovato",
  "profile": "iOS Developer with over 7 years of experience designing and building robust, scalable mobile applications. Specialized in Swift, SwiftUI, and Combine, with strong expertise in integrating RESTful APIs and implementing CI/CD pipelines using tools like Fastlane and GitLab CI. I have worked in cross-functional Agile/SCRUM teams, actively contributing to user story planning and architectural decisions. I’m passionate about modular architectures, automated testing, and user-focused development — always aiming to improve code quality and development efficiency. Curious by nature, I also explore areas such as embedded systems and intelligent automation, constantly seeking to bring added value through technological innovation.",
  "relevant_experience": [
    {
      "title": "iOS Developer",
      "company": "Cortado Mobile Solutions",
      "location": "Berlin",
      "period": "August 2018 – Present",
      "description": "Worked productively with a SCRUM Team of 9 members (2 iOS, 2 Android, 3 Server, 1 Web, 1 QA) to deliver features for mobile device and portfolio management. At Cortado, I fully developed 2 apps and maintained 3 more, all published in the App Store. I implemented CI/CD tools such as Fastlane, Jenkins, and GitLab CI. I also improved existing codebases by applying clean architecture principles, increasing modularity and test coverage."
    },
    {
      "title": "Mobile Developer",
      "company": "Apparound",
      "location": "Pisa, Italy",
      "period": "September 2015 – July 2018",
      "description": "Worked as an Android and occasionally iOS developer within a SCRUM team. I contributed to the implementation of numerous features and redesigns of graphical interfaces. I designed and developed internal libraries and core components to be reused across the app. I also actively worked on improving performance and resolving long-standing bugs."
    },
    {
      "title": "Android Developer (Internship)",
      "company": "Marte 5",
      "location": "Livorno, Italy",
      "period": "May 2015 – August 2015",
      "description": "Collaborated with architects, engineers, and product managers to develop Android applications with Augmented Reality features (using Vuforia and Wikitude SDKs). Ensured that mobile content met business and client specifications, delivering reliable, performance-conscious code."
    }
  ],
  "education": [
    {
      "degree": "M.Sc. in Mobile Application Development",
      "school": "Università degli Studi di Pisa",
      "period": "2015",
      "description": "Acquired skills to design, develop, deploy and maintain mobile applications for end users or for integration into complex information systems. Gained deep knowledge of the Cocoa Touch framework (iOS), Android and Windows Universal App. Technologies used included Swift, Objective-C, Java, XAML and XML."
    },
    {
      "degree": "B.Sc. in Computer Engineering",
      "school": "Università degli Studi di Catania",
      "period": "2009",
      "description": "Graduated with a thesis on 'Capacitive sensors applications to silicon electrodes on a mold for RTM technology'. Designed and built a flexible physical sensor, all supporting electronics, and custom software to analyze data."
    }
  ],
  "skills": [
    { "name": "Swift", "level": 5 },
    { "name": "SwiftUI", "level": 4 },
    { "name": "UIKit", "level": 4 },
    { "name": "Combine", "level": 4 },
    { "name": "Core Data", "level": 4 },
    { "name": "Git", "level": 4 },
    { "name": "CI/CD", "level": 4 },
    { "name": "Fastlane", "level": 4 },
    { "name": "Firebase", "level": 3 },
    { "name": "OAuth2", "level": 3 },
    { "name": "REST APIs", "level": 5 }
  ],
  "languages": [
    { "name": "Italian", "level": "Native" },
    { "name": "English", "level": "Fluent" },
    { "name": "German", "level": "Elementary" }
  ],
  "certifications": [
    {
      "name": "iOS Lead Essentials",
      "issuer": "Essential Developer Academy",
      "year": 2024,
      "url": "https://academy.essentialdeveloper.com/achievements/cc210373-d44f-4345-aff2-a1402b5104d4",
      "description": "Comprehensive training program designed to elevate iOS developers to complete senior professionals. Covered advanced topics such as modular architecture, Test-Driven Development (TDD), Clean Architecture, and effective system design. Included hands-on code challenges reviewed by senior developers, live mentoring sessions, and access to a global community of iOS professionals."
    }
  ],
  "interests": [
    "Robotics",
    "Reading",
    "Dungeons & Dragons",
    "Manga",
    "Gaming",
    "Kayak",
    "Hiking"
  ]
}